org-config.org
#+TITLE: Org-mode settings
#+PROPERTY: header-args+ :comments both
#+PROPERTY: header-args+ :mkdirp yes
#+PROPERTY: header-args+ :tangle "org-config.el"
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+OPTIONS: \n:t
* Initialize variables
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/org")
(setq my-config-folder "~/emacs-spacemacs-config")
#+END_SRC
* Appearance
Indent headings and text
#+BEGIN_SRC emacs-lisp
(require 'org-indent)
(setq org-startup-indented t)
#+END_SRC

Do not truncate lines and enable word wrap
#+BEGIN_SRC emacs-lisp
(set-default 'truncate-lines nil)
(set-default 'word-wrap t)
(setq helm-buffers-truncate-lines nil)
(setq org-startup-truncated nil)
#+END_SRC

Do not align Tags automatically
#+BEGIN_SRC emacs-lisp
(setq org-auto-align-tags nil)
#+END_SRC

Set the symbols for different heading levels
#+BEGIN_SRC emacs-lisp
;; (setq org-bullets-bullet-list (quote ("◉" "◆" "✚" "☀" "○")))
(setq org-superstar-bullet-list '("◉" "◆" "✚" "☀" "○"))
#+END_SRC

On startup, content should be in folded state
#+BEGIN_SRC emacs-lisp
(setq org-startup-folded t)
#+END_SRC

Count all checkboxes, not just the ones directly below
#+BEGIN_SRC emacs-lisp
;; (setq org-checkbox-hierarchical-statistics nil)
#+END_SRC

Custom ~org-display-inline-images~ function that displays the images according to the logic:
1. Always conserve the aspect ratio
2. Image shouldn't exceed the current window's width (minus 50 pixels)
3. Image shouldn't exceed half of the current window's height
4. Resize only if the actual dimensions do not conform to the above two points
#+BEGIN_SRC emacs-lisp
(setq org-image-actual-width 1800)
(load (concat my-config-folder "/org-display-inline-images-custom.el"))
#+END_SRC

Smooth scrolling with mouse:
from https://emacs.stackexchange.com/questions/10354/smooth-mouse-scroll-for-inline-images
#+BEGIN_SRC emacs-lisp
(pixel-scroll-mode)
(setq pixel-dead-time 0) ; Never go back to the old scrolling behaviour.
(setq pixel-resolution-fine-flag t) ; Scroll by number of pixels instead of lines (t = frame-char-height pixels).
(setq mouse-wheel-scroll-amount '(1)) ; Distance in pixel-resolution to scroll each mouse wheel event.
(setq mouse-wheel-progressive-speed nil) ; Progressive speed is too fast
#+END_SRC

* To-Do states and related
Keywords
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      (quote
       ((sequence "TODO" "PROG" "PAUS" "REVW" "|" "DONE" "CANC"))))
#+END_SRC

Colors for todo states
#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
      '(("PROG" . "orange") ("PAUS" . "magenta") ("REVW" . "magenta") ("CANC" . "red") ("DONE" . "green")))
#+END_SRC

Priority settings
#+BEGIN_SRC emacs-lisp
(setq org-default-priority 10)
(setq org-highest-priority 1)
(setq org-lowest-priority 64)
#+END_SRC

