org-config.org
* Agenda
Enable the compact layout in agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-compact-blocks t)
#+END_SRC

Restore layout after exit from agenda view
#+BEGIN_SRC emacs-lisp
(setq org-agenda-restore-windows-after-quit t)
#+END_SRC

Default appointment duration
#+BEGIN_SRC emacs-lisp
(setq org-agenda-default-appointment-duration 30)
#+END_SRC

Pressing ~Tab~ while the cursor is on a task will expand that task in a separate buffer
#+BEGIN_SRC emacs-lisp
(add-hook 'org-agenda-mode-hook
          (lambda () (local-set-key [tab] 'org-agenda-tree-to-indirect-buffer)))
#+END_SRC

Include these files and directories when creating the agenda
#+BEGIN_SRC emacs-lisp
  ;; (setq org-agenda-files '(org-directory))
  (setq org-agenda-files (append
                          (directory-files-recursively "~/Google Drive/org" "\\.org$")
                          (directory-files-recursively org-directory "\\.org$")
                          (directory-files-recursively org-directory "\\.org.txt$")))
#+END_SRC

Don't show tasks in agenda if they are done
#+BEGIN_SRC emacs-lisp
(setq org-agenda-skip-deadline-if-done t)
(setq org-agenda-skip-scheduled-if-done t)
#+END_SRC

Max number of days to show in agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-span 90)
#+END_SRC

Warn about a deadline
#+BEGIN_SRC emacs-lisp
(setq org-deadline-warning-days 90)
#+END_SRC

Agenda starts on the current day
#+BEGIN_SRC emacs-lisp
(setq org-agenda-start-on-weekday nil)
#+END_SRC

Sorting strategy
#+BEGIN_SRC emacs-lisp
(setq org-agenda-sorting-strategy
      (quote
       ((agenda priority-down alpha-up)
        (todo priority-down alpha-up)
        (tags priority-down alpha-up))))
#+END_SRC

Display format
#+BEGIN_SRC emacs-lisp
(setq org-agenda-prefix-format
      (quote
       ((agenda . "%s %?-12t %e ")
        (timeline . "  %s")
        (todo . " %i %e ")
        (tags . " %i %e ")
        (search . " %i %e "))))

#+END_SRC

Default format for columns view
#+BEGIN_SRC emacs-lisp
(setq org-columns-default-format
      "%75ITEM %TODO %PRIORITY %SCHEDULED %DEADLINE %CLOSED %ALLTAGS")
#+END_SRC

Place tags close to the right-hand side of the window. From http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html
#+BEGIN_SRC emacs-lisp
(add-hook 'org-finalize-agenda-hook 'place-agenda-tags)
(defun place-agenda-tags ()
  "Put the agenda tags by the right border of the agenda window."
  (setq org-agenda-tags-column (- 4 (window-width)))
  (org-agenda-align-tags))
#+END_SRC

By default, agenda will reorganize frames/splits
#+BEGIN_SRC emacs-lisp
(setq org-agenda-window-setup 'reorganize-frame)
#+END_SRC

By default, Org maintains only a single agenda buffer and rebuilds it each time you change the view, to make sure everything is always up to date. If you often switch between agenda views and the build time bothers you, you can turn on sticky agenda buffers or make this the default by customizing the variable org-agenda-sticky. With sticky agendas, the agenda dispatcher will not recreate agenda views from scratch, it will only switch to the selected one, and you need to update the agenda by hand with r or g when needed. You can toggle sticky agenda view any time with org-toggle-sticky-agenda.
#+BEGIN_SRC emacs-lisp
(setq org-agenda-sticky nil)
#+END_SRC

When you run an agenda command, Org visits agenda files that are not yet visited. When finding a file for the first time, Org checks the startup options and apply them to the buffer: those options are either globally set through the org-startup-* variables or on a per-file basis through the #+STARTUP keyword. Especially, Org will honor the startup visibility status, as set by org-startup-folded or #+STARTUP: folded. This may slow down the operation of visiting a file very much, and the process of selecting agenda entries consequently. To prevent agenda commands to honor startup options when visiting an agenda file for the first time, do this
#+BEGIN_SRC emacs-lisp
(setq org-agenda-inhibit-startup t)
#+END_SRC

* Custom agenda views
