org-config.html
<div id="outline-container-org8456fee" class="outline-2">
<h2 id="org8456fee"><span class="section-number-2">4</span> Agenda</h2>
<div class="outline-text-2" id="text-4">
<p>
Enable the compact layout in agenda<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-compact-blocks t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Restore layout after exit from agenda view<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-restore-windows-after-quit t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Default appointment duration<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-default-appointment-duration <span class="org-highlight-numbers-number">30</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Pressing <code>Tab</code> while the cursor is on a task will expand that task in a separate buffer<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'org-agenda-mode-hook
          <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lambda</span> <span class="org-rainbow-delimiters-depth-3">()</span> <span class="org-rainbow-delimiters-depth-3">(</span>local-set-key <span class="org-rainbow-delimiters-depth-4">[</span>tab<span class="org-rainbow-delimiters-depth-4">]</span> 'org-agenda-tree-to-indirect-buffer<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Include these files and directories when creating the agenda<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-files '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"~/Dropbox/org"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Don't show tasks in agenda if they are done<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-skip-deadline-if-done t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-skip-scheduled-if-done t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Max number of days to show in agenda<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-span <span class="org-highlight-numbers-number">45</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Warn about a deadline<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-deadline-warning-days <span class="org-highlight-numbers-number">90</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Agenda starts on the current day<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-start-on-weekday nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Sorting strategy<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-sorting-strategy
      <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span>
       <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>agenda priority-down alpha-up<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>todo priority-down alpha-up<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>tags priority-down alpha-up<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Display format<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-prefix-format
      <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span>
       <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>agenda . <span class="org-string">"%s %?-12t %e "</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>timeline . <span class="org-string">"  %s"</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>todo . <span class="org-string">" %i %e "</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>tags . <span class="org-string">" %i %e "</span><span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span>search . <span class="org-string">" %i %e "</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

</pre>
</div>

<p>
Default format for columns view<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-columns-default-format
      <span class="org-string">"%75ITEM %TODO %PRIORITY %SCHEDULED %DEADLINE %CLOSED %ALLTAGS"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Place tags close to the right-hand side of the window. From <a href="http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html">http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html</a><br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'org-finalize-agenda-hook 'place-agenda-tags<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">place-agenda-tags</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-doc">"Put the agenda tags by the right border of the agenda window."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> org-agenda-tags-column <span class="org-rainbow-delimiters-depth-3">(</span>- <span class="org-highlight-numbers-number">4</span> <span class="org-rainbow-delimiters-depth-4">(</span>window-width<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>org-agenda-align-tags<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
By default, agenda will reorganize frames/splits<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-window-setup 'reorganize-frame<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
By default, Org maintains only a single agenda buffer and rebuilds it each time you change the view, to make sure everything is always up to date. If you often switch between agenda views and the build time bothers you, you can turn on sticky agenda buffers or make this the default by customizing the variable org-agenda-sticky. With sticky agendas, the agenda dispatcher will not recreate agenda views from scratch, it will only switch to the selected one, and you need to update the agenda by hand with r or g when needed. You can toggle sticky agenda view any time with org-toggle-sticky-agenda.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-sticky nil<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
When you run an agenda command, Org visits agenda files that are not yet visited. When finding a file for the first time, Org checks the startup options and apply them to the buffer: those options are either globally set through the org-startup-* variables or on a per-file basis through the #+STARTUP keyword. Especially, Org will honor the startup visibility status, as set by org-startup-folded or #+STARTUP: folded. This may slow down the operation of visiting a file very much, and the process of selecting agenda entries consequently. To prevent agenda commands to honor startup options when visiting an agenda file for the first time, do this<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-inhibit-startup t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7eb4ead" class="outline-2">
<h2 id="org7eb4ead"><span class="section-number-2">5</span> Custom agenda views</h2>
<div class="outline-text-2" id="text-5">
</div>
