org-config.html
<div id="outline-container-orgc3a652f" class="outline-3">
<h3 id="orgc3a652f"><span class="section-number-3">5.1</span> Helper functions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Extract the date of completion, and use it for comparison. From <a href="http://emacs.stackexchange.com/questions/26351/custom-sorting-for-agenda">http://emacs.stackexchange.com/questions/26351/custom-sorting-for-agenda</a><br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">cmp-date-property</span> <span class="org-rainbow-delimiters-depth-2">(</span>prop<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Compare two `</span><span class="org-doc"><span class="org-constant">org-mode</span></span><span class="org-doc">' agenda entries, `A' and `B', by some date property. If a is before b, return -1. If a is after b, return 1. If they are equal return t."</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">lexical-let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>prop prop<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    #'<span class="org-rainbow-delimiters-depth-3">(</span>lambda <span class="org-rainbow-delimiters-depth-4">(</span>a b<span class="org-rainbow-delimiters-depth-4">)</span>

        <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>a-pos <span class="org-rainbow-delimiters-depth-7">(</span>get-text-property <span class="org-highlight-numbers-number">0</span> 'org-marker a<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
               <span class="org-rainbow-delimiters-depth-6">(</span>b-pos <span class="org-rainbow-delimiters-depth-7">(</span>get-text-property <span class="org-highlight-numbers-number">0</span> 'org-marker b<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
               <span class="org-rainbow-delimiters-depth-6">(</span>a-date <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-keyword">or</span> <span class="org-rainbow-delimiters-depth-8">(</span>org-entry-get a-pos prop<span class="org-rainbow-delimiters-depth-8">)</span>
                           <span class="org-rainbow-delimiters-depth-8">(</span>format <span class="org-string">"&lt;%s&gt;"</span> <span class="org-rainbow-delimiters-depth-9">(</span>org-read-date t nil <span class="org-string">"now"</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
               <span class="org-rainbow-delimiters-depth-6">(</span>b-date <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-keyword">or</span> <span class="org-rainbow-delimiters-depth-8">(</span>org-entry-get b-pos prop<span class="org-rainbow-delimiters-depth-8">)</span>
                           <span class="org-rainbow-delimiters-depth-8">(</span>format <span class="org-string">"&lt;%s&gt;"</span> <span class="org-rainbow-delimiters-depth-9">(</span>org-read-date t nil <span class="org-string">"now"</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
               <span class="org-rainbow-delimiters-depth-6">(</span>cmp <span class="org-rainbow-delimiters-depth-7">(</span>compare-strings a-date nil nil b-date nil nil<span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span>
               <span class="org-rainbow-delimiters-depth-5">)</span>
          <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-6">(</span>eq cmp t<span class="org-rainbow-delimiters-depth-6">)</span> nil <span class="org-rainbow-delimiters-depth-6">(</span>signum cmp<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
          <span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Display the total number of tasks in Agenda. From <a href="http://emacs.stackexchange.com/questions/18710/display-count-of-tasks-in-agenda-instead-of-tasks-based-on-tag">http://emacs.stackexchange.com/questions/18710/display-count-of-tasks-in-agenda-instead-of-tasks-based-on-tag</a><br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>load <span class="org-string">"~/emacs-spacemacs-config/org-agenda-count.el"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Sort agenda items by link's text and not link's URL<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">remove-priority</span> <span class="org-rainbow-delimiters-depth-2">(</span>str<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>replace-regexp-in-string <span class="org-string">"\\[#[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">\\[]*\\] "</span> <span class="org-string">""</span> str<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">extract-link-text</span> <span class="org-rainbow-delimiters-depth-2">(</span>str<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>replace-regexp-in-string <span class="org-string">"\\[\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">][]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">][]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">?\\]"</span> <span class="org-string">"\\3"</span> str<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">org-cmp-alpha-2</span> <span class="org-rainbow-delimiters-depth-2">(</span>a b<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-doc">"Compare the headlines, alphabetically. (after extract link texts if any links present)"</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>pla <span class="org-rainbow-delimiters-depth-5">(</span>text-property-any <span class="org-highlight-numbers-number">0</span> <span class="org-rainbow-delimiters-depth-6">(</span>length a<span class="org-rainbow-delimiters-depth-6">)</span> 'org-heading t a<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>plb <span class="org-rainbow-delimiters-depth-5">(</span>text-property-any <span class="org-highlight-numbers-number">0</span> <span class="org-rainbow-delimiters-depth-6">(</span>length b<span class="org-rainbow-delimiters-depth-6">)</span> 'org-heading t b<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>ta <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">and</span> pla <span class="org-rainbow-delimiters-depth-6">(</span>substring a pla<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>tb <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">and</span> plb <span class="org-rainbow-delimiters-depth-6">(</span>substring b plb<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
         <span class="org-rainbow-delimiters-depth-4">(</span>case-fold-search nil<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> pla
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-5">(</span>string-match <span class="org-rainbow-delimiters-depth-6">(</span>concat <span class="org-string">"\\`[ \t]*"</span> <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-keyword">or</span> <span class="org-rainbow-delimiters-depth-8">(</span>get-text-property <span class="org-highlight-numbers-number">0</span> 'org-todo-regexp a<span class="org-rainbow-delimiters-depth-8">)</span> <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-7">)</span>
                                  <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[ \t]*\\[[a-zA-Z0-9]\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">? *"</span><span class="org-rainbow-delimiters-depth-6">)</span> <span class="org-warning">ta</span><span class="org-warning"><span class="org-rainbow-delimiters-depth-5">)</span></span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> ta <span class="org-rainbow-delimiters-depth-6">(</span>substring ta <span class="org-rainbow-delimiters-depth-7">(</span>match-end <span class="org-highlight-numbers-number">0</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> ta <span class="org-rainbow-delimiters-depth-5">(</span>downcase ta<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> plb
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-5">(</span>string-match <span class="org-rainbow-delimiters-depth-6">(</span>concat <span class="org-string">"\\`[ \t]*"</span> <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-keyword">or</span> <span class="org-rainbow-delimiters-depth-8">(</span>get-text-property <span class="org-highlight-numbers-number">0</span> 'org-todo-regexp b<span class="org-rainbow-delimiters-depth-8">)</span> <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-7">)</span>
                                  <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[ \t]*\\[[a-zA-Z0-9]\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">? *"</span><span class="org-rainbow-delimiters-depth-6">)</span> <span class="org-warning">tb</span><span class="org-warning"><span class="org-rainbow-delimiters-depth-5">)</span></span>
        <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-keyword">setq</span> tb <span class="org-rainbow-delimiters-depth-6">(</span>substring tb <span class="org-rainbow-delimiters-depth-7">(</span>match-end <span class="org-highlight-numbers-number">0</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">setq</span> tb <span class="org-rainbow-delimiters-depth-5">(</span>downcase tb<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> ta <span class="org-rainbow-delimiters-depth-4">(</span>extract-link-text ta<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">setq</span> tb <span class="org-rainbow-delimiters-depth-4">(</span>extract-link-text tb<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">cond</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>not <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-keyword">or</span> ta tb<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span> nil<span class="org-rainbow-delimiters-depth-4">)</span>
          <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>not ta<span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-highlight-numbers-number">+1</span><span class="org-rainbow-delimiters-depth-4">)</span>
          <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>not tb<span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-highlight-numbers-number">-1</span><span class="org-rainbow-delimiters-depth-4">)</span>
          <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>string-lessp ta tb<span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-highlight-numbers-number">-1</span><span class="org-rainbow-delimiters-depth-4">)</span>
          <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-rainbow-delimiters-depth-5">(</span>string-lessp tb ta<span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-highlight-numbers-number">+1</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
