org-config.org
** Views
#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      (quote
       (
        ("Q" "Closed Tasks"
         ((tags "CLOSED>=\"<-4w>\"" (
                                     (org-agenda-cmp-user-defined (cmp-date-property "CLOSED"))
                                     (org-agenda-sorting-strategy '(user-defined-down))
                                     (org-agenda-overriding-header (format "Tasks done in the last week (%s)" (org-agenda-count "CLOSED")))
                                     )))
         nil)
        ("H" "Z Tasks"
         ((tags-todo "+PRIORITY=\"Z\""
                     ((org-agenda-overriding-header (format "Z Tasks (%s)" (org-agenda-count ""))))))
         nil)
        ("W" "Work ToDos"
         ((tags-todo "+work"
                     ((org-agenda-overriding-header (format "Work Tasks (%s)" (org-agenda-count "")))
                      (org-agenda-hide-tags-regexp "work")
                       (org-agenda-sorting-strategy '(priority-down))
                      )))
         nil)
        ("E" "Non-Work ToDos"
         ((tags-todo "-work-paper" (
                              (org-agenda-overriding-header (format "Non-Work Tasks (%s)" (org-agenda-count "")))
                              (org-agenda-sorting-strategy '(priority-down))
                              )))
         nil)
        ("B" "Books"
         ((tags-todo "+book" (
                              (org-agenda-overriding-header (format "Books (%s)" (org-agenda-count "")))
                              (org-agenda-sorting-strategy '(priority-down))
                              )))
         nil)
        )))
#+END_SRC
* Export
Stylize exported html according to specified CSS
#+BEGIN_SRC emacs-lisp
(setq org-html-htmlize-output-type 'css)
(setq org-html-html5-fancy t
      org-html-doctype "html5")
#+END_SRC

Backends to enable
#+BEGIN_SRC emacs-lisp
(setq org-export-backends (quote (html icalendar md)))
#+END_SRC

Do not use babel on export
#+BEGIN_SRC emacs-lisp
(setq org-export-use-babel nil)
#+END_SRC

* Refile
#+BEGIN_SRC emacs-lisp
(setq org-refile-allow-creating-parent-nodes (quote confirm))
(setq org-refile-targets '((nil :maxlevel . 9)
                           (org-agenda-files :maxlevel . 9)))
(setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
(setq org-refile-use-outline-path (quote file))       ; Show full paths for refiling
#+END_SRC
* Clocking
Log the clocks into this drawer
#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer "LOGBOOK")
#+END_SRC

Remember to clock out the clock on exit
#+BEGIN_SRC emacs-lisp
(setq org-remember-clock-out-on-exit t)
#+END_SRC

Display clock time both in mode line and frame title
#+BEGIN_SRC emacs-lisp
(setq org-clock-clocked-in-display (quote both))
#+END_SRC
