org-config.html
<div id="outline-container-org033c481" class="outline-3">
<h3 id="org033c481"><span class="section-number-3">5.2</span> Views</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-agenda-custom-commands
      <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span>
       <span class="org-rainbow-delimiters-depth-3">(</span>
        <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"Q"</span> <span class="org-string">"Closed Tasks"</span>
         <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>tags <span class="org-string">"CLOSED&gt;=\"&lt;-4w&gt;\""</span> <span class="org-rainbow-delimiters-depth-7">(</span>
                                     <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-cmp-user-defined <span class="org-rainbow-delimiters-depth-9">(</span>cmp-date-property <span class="org-string">"CLOSED"</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                                     <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-sorting-strategy '<span class="org-rainbow-delimiters-depth-9">(</span>user-defined-down<span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                                     <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-overriding-header <span class="org-rainbow-delimiters-depth-9">(</span>format <span class="org-string">"Tasks done in the last week (%s)"</span> <span class="org-rainbow-delimiters-depth-1">(</span>org-agenda-count <span class="org-string">"CLOSED"</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                                     <span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
         nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"H"</span> <span class="org-string">"Z Tasks"</span>
         <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>tags-todo <span class="org-string">"+PRIORITY=\"Z\""</span>
                     <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-overriding-header <span class="org-rainbow-delimiters-depth-9">(</span>format <span class="org-string">"Z Tasks (%s)"</span> <span class="org-rainbow-delimiters-depth-1">(</span>org-agenda-count <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span><span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
         nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"W"</span> <span class="org-string">"Work ToDos"</span>
         <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>tags-todo <span class="org-string">"+work"</span>
                     <span class="org-rainbow-delimiters-depth-7">(</span><span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-overriding-header <span class="org-rainbow-delimiters-depth-9">(</span>format <span class="org-string">"Work Tasks (%s)"</span> <span class="org-rainbow-delimiters-depth-1">(</span>org-agenda-count <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                      <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-hide-tags-regexp <span class="org-string">"work"</span><span class="org-rainbow-delimiters-depth-8">)</span>
                      <span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
         nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"E"</span> <span class="org-string">"Non-Work ToDos"</span>
         <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">(</span>tags-todo <span class="org-string">"-work"</span> <span class="org-rainbow-delimiters-depth-7">(</span>
                              <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-overriding-header <span class="org-rainbow-delimiters-depth-9">(</span>format <span class="org-string">"Non-Work Tasks (%s)"</span> <span class="org-rainbow-delimiters-depth-1">(</span>org-agenda-count <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                              <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-cmp-user-defined 'org-cmp-alpha-2<span class="org-rainbow-delimiters-depth-8">)</span>
                              <span class="org-rainbow-delimiters-depth-8">(</span>org-agenda-sorting-strategy '<span class="org-rainbow-delimiters-depth-9">(</span>user-defined-up<span class="org-rainbow-delimiters-depth-9">)</span><span class="org-rainbow-delimiters-depth-8">)</span>
                              <span class="org-rainbow-delimiters-depth-7">)</span><span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span>
         nil<span class="org-rainbow-delimiters-depth-4">)</span>
        <span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9f97c7" class="outline-2">
<h2 id="orga9f97c7"><span class="section-number-2">6</span> Export</h2>
<div class="outline-text-2" id="text-6">
<p>
Stylize exported html according to specified CSS<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-html-htmlize-output-type 'css<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-html-html5-fancy t
      org-html-doctype <span class="org-string">"html5"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Backends to enable<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-export-backends <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span> <span class="org-rainbow-delimiters-depth-3">(</span>html icalendar md<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org23d99a1" class="outline-2">
<h2 id="org23d99a1"><span class="section-number-2">7</span> Refile</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-refile-allow-creating-parent-nodes <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span> confirm<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-refile-targets '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">(</span>nil <span class="org-builtin">:maxlevel</span> . <span class="org-highlight-numbers-number">9</span><span class="org-rainbow-delimiters-depth-3">)</span>
                           <span class="org-rainbow-delimiters-depth-3">(</span>org-agenda-files <span class="org-builtin">:maxlevel</span> . <span class="org-highlight-numbers-number">9</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-outline-path-complete-in-steps nil<span class="org-rainbow-delimiters-depth-1">)</span>         <span class="org-comment-delimiter">; </span><span class="org-comment">Refile in a single go</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-refile-use-outline-path <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span> file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>       <span class="org-comment-delimiter">; </span><span class="org-comment">Show full paths for refiling</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5cf8432" class="outline-2">
<h2 id="org5cf8432"><span class="section-number-2">8</span> Clocking</h2>
<div class="outline-text-2" id="text-8">
<p>
Log the clocks into this drawer<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-log-into-drawer <span class="org-string">"LOGBOOK"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Remember to clock out the clock on exit<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-remember-clock-out-on-exit t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Display clock time both in mode line and frame title<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-clock-clocked-in-display <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">quote</span> both<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
