org-config.org
* Miscellaneous
Modules to load
#+BEGIN_SRC emacs-lisp
(setq org-modules (quote (org-crypt org-habit org-mouse)))
#+END_SRC

Prevent editing in the invisible area
#+BEGIN_SRC emacs-lisp
(setq org-catch-invisible-edits (quote show-and-error))
#+END_SRC

Do not show empty lines between subtrees, when collapsed
#+BEGIN_SRC emacs-lisp
(setq org-cycle-separator-lines 0)
#+END_SRC

Collapse everything except current tab. From https://stackoverflow.com/questions/25161792/emacs-org-mode-how-can-i-fold-everything-but-the-current-headline
#+BEGIN_SRC emacs-lisp
(defun org-show-current-heading-tidily ()
  (interactive)
  "Show next entry, keeping other entries closed."
  (if (save-excursion (end-of-line) (outline-invisible-p))
      (progn (org-show-entry) (show-children))
    (outline-back-to-heading)
    (unless (and (bolp) (org-on-heading-p))
      (org-up-heading-safe)
      (hide-subtree)
      (error "Boundary reached"))
    (org-overview)
    (org-reveal t)
    (org-show-entry)
    (show-children)))
#+END_SRC

~helm-org-rifle~ settings
#+BEGIN_SRC emacs-lisp
;; (require 'helm-org-rifle)
;; (setq helm-org-rifle-show-path t)
#+END_SRC

~org-download~ settings
#+BEGIN_SRC emacs-lisp
(require 'org-download)
(setq-default org-download-image-dir nil)
#+END_SRC

Load a requirement for ~org-cliplink~
#+BEGIN_SRC emacs-lisp
(load (concat my-config-folder "/emacs-request/request.el"))
#+END_SRC

Alerts:
- https://github.com/akhramov/org-wild-notifier.el
- https://github.com/spegoraro/org-alert
#+BEGIN_SRC emacs-lisp
(require 'org-alert)
(setq alert-default-style 'libnotify)
#+END_SRC

