org-config.org
* Disabled
#+BEGIN_SRC emacs-lisp
  
  ;; org-publish
  ;; (require 'ox-publish)
  ;; (setq org-publish-project-alist
  ;;       '(
  ;;         ("org"
  ;;          :base-directory "~/Dropbox/org/"
  ;;          :publishing-directory "~/Dropbox/org/"
  ;;          :base-extension "---"
  ;;          :recursive nil
  ;;          :publishing-function org-html-publish-to-html
  ;;          :include ("bayesian.org" "classification.org" "clustering.org" "data_science_misc.org" "data_structs_algos.org" "deep_learning.org" "ds_tools.org" "machine_learning_misc.org" "nlp.org" "recommendations.org" "regression.org" "reinforcement-learning.org" "statistics.org" "supervised_learning.org" "time_series.org")
  ;;          )))
  
  ;; change ... to
  ;; (setq org-ellipsis "⤵")
  
  ;; calendar export settings
  ;; (setq org-icalendar-exclude-tags (quote ("noexport")))
  ;; (setq org-icalendar-include-todo t)
  ;; (setq org-icalendar-use-deadline (quote (event-if-not-todo event-if-todo)))
  ;; (setq org-icalendar-use-scheduled (quote (event-if-not-todo event-if-todo)))
  
  ;; lists are also collapsed by default, not just headings
  ;; (setq org-cycle-include-plain-lists 'integrate)
  
  ;; Don't show tasks with "home" tag during day time
  ;; (defun my/org-agenda-skip-home ()
  ;;   (let ((current-hour (string-to-number (format-time-string "%H"))))
  ;;     (when (and (< 10 current-hour 18)
  ;;                (member "home" (org-get-tags-at)))
  ;;       (or (outline-next-heading)
  ;;           (goto-char (point-max))))))
  ;; (setq org-agenda-skip-function #'my/org-agenda-skip-home)
#+END_SRC
* Final
Let the Spacemacs use this configuration.
#+BEGIN_SRC emacs-lisp
(provide 'org-config)
#+END_SRC


