org-config.html
<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'ox-publish)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-publish-project-alist</span>
<span class="org-comment-delimiter">;;       </span><span class="org-comment">'(</span>
<span class="org-comment-delimiter">;;         </span><span class="org-comment">("org"</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:base-directory "~/Dropbox/org/"</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:publishing-directory "~/Dropbox/org/"</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:base-extension "---"</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:recursive nil</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:publishing-function org-html-publish-to-html</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">:include ("bayesian.org" "classification.org" "clustering.org" "data_science_misc.org" "data_structs_algos.org" "deep_learning.org" "ds_tools.org" "machine_learning_misc.org" "nlp.org" "recommendations.org" "regression.org" "reinforcement-learning.org" "statistics.org" "supervised_learning.org" "time_series.org")</span>
<span class="org-comment-delimiter">;;          </span><span class="org-comment">)))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">change ... to</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-ellipsis "&#10549;")</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">calendar export settings</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-icalendar-exclude-tags (quote ("noexport")))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-icalendar-include-todo t)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-icalendar-use-deadline (quote (event-if-not-todo event-if-todo)))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-icalendar-use-scheduled (quote (event-if-not-todo event-if-todo)))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">lists are also collapsed by default, not just headings</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-cycle-include-plain-lists 'integrate)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Don't show tasks with "home" tag during day time</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(defun my/org-agenda-skip-home ()</span>
<span class="org-comment-delimiter">;;   </span><span class="org-comment">(let ((current-hour (string-to-number (format-time-string "%H"))))</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(when (and (&lt; 10 current-hour 18)</span>
<span class="org-comment-delimiter">;;                </span><span class="org-comment">(member "home" (org-get-tags-at)))</span>
<span class="org-comment-delimiter">;;       </span><span class="org-comment">(or (outline-next-heading)</span>
<span class="org-comment-delimiter">;;           </span><span class="org-comment">(goto-char (point-max))))))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(setq org-agenda-skip-function #'my/org-agenda-skip-home)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org726fe38" class="outline-2">
<h2 id="org726fe38"><span class="section-number-2">12</span> Final</h2>
<div class="outline-text-2" id="text-12">
<p>
Let the Spacemacs use this configuration.<br>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">provide</span> '<span class="org-constant">org-config</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sainath Adapa</p>
<p class="date">Created: 2019-04-20 Sat 16:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
